{
  "name": "Copy of Employee Turnover Analysis Dashboard v4.1",
  "description": "1. KPIs Clave del Mes (Vista Rápida)\nEl dashboard comienza con los indicadores más críticos para darte un panorama inmediato de la situación.\nMétricas Esenciales: Muestra la Rotación Mensual, el total de Bajas del Mes y el Headcount Activo.\nFoco Estratégico: Todos los cálculos se centran en los empleados Clase 1 (operativos) y en las bajas más relevantes (Renuncia Voluntaria y Bajas por Faltas), permitiéndote analizar la rotación que realmente puedes gestionar.\n2. Proyección de Bajas (Análisis de Tendencia)\nEsta sección te ayuda a ver más allá del mes actual para entender la dirección de la rotación.\nTendencia Visual: Grafica las bajas históricas y superpone una línea de tendencia para visualizar si la rotación está aumentando, disminuyendo o se mantiene estable.\nPronóstico a Futuro: Utiliza la tendencia para proyectar el número esperado de bajas para los próximos dos meses, ayudándote a anticipar y planificar.\nControl de Vista: Puedes alternar con un botón entre ver solo el año en curso o el histórico completo, para un análisis enfocado o de largo plazo.\n3. Comparativa Anual de Bajas (Análisis Contextual)\nPermite entender si el rendimiento actual es bueno o malo en comparación con el pasado.\nRojo vs. Verde: Compara las bajas de cada mes contra el mismo mes del año anterior. Las barras se colorean de rojo si la rotación empeoró y de verde si mejoró, para una interpretación instantánea.\nInformación Detallada: Al pasar el cursor sobre una barra, te muestra las bajas del mes actual, las del año anterior y el porcentaje exacto de cambio.\nVista Flexible: También cuenta con el botón para cambiar entre la vista del año actual y el histórico completo.\n4. Análisis de Motivos de Baja (Inteligencia Artificial)\nEsta es una de las funciones más avanzadas, ya que extrae insights valiosos de los comentarios de texto libre.\nClasificación con IA: Utiliza la API de Gemini para leer y entender los comentarios de las entrevistas de salida y los clasifica automáticamente en 16 categorías estandarizadas.\nAprendizaje Continuo: Si la IA comete un error, puedes reclasificar un comentario directamente en la tabla. El sistema guarda tu corrección en tu navegador y la usa como ejemplo en el próximo análisis para volverse más preciso con el tiempo.\nRobustez: Si por alguna razón la IA no está disponible, el sistema recurre a un método de análisis por palabras clave para asegurar que siempre tengas un resultado.\n5. Análisis Pareto 80/20 (Foco en el Impacto)\nTe ayuda a identificar dónde enfocar tus esfuerzos para obtener el mayor impacto.\nIdentificación de Causas Raíz: Aplica el principio 80/20 para mostrarte qué Turnos, Puestos, Áreas y Supervisores concentran la mayor parte de las bajas.\nFusión de Datos Inteligente: Para garantizar la máxima precisión, el sistema combina la información de tus archivos Matriz de Rotación y Bajas, dando prioridad a los datos más completos y evitando problemas de \"SIN DATO\".\n6. Análisis de Supervivencia (Retención a Largo Plazo)\nEste análisis te dice no solo cuánta gente se va, sino cuándo se va.\nCurva Kaplan-Meier: Muestra la probabilidad de que un empleado permanezca en la empresa a lo largo del tiempo, ayudando a visualizar los puntos críticos del ciclo de vida del empleado.\nMétricas Clave con Explicación: Presenta métricas vitales como S(30), S(90) y la Mediana de Supervivencia. Cada una tiene un ícono de información (ℹ️) que te explica qué significa y cómo interpretarla.\nRiesgo de Baja Temprana: Una gráfica específica te muestra la probabilidad de baja en los primeros 3 meses (0-30, 31-60, 61-90 días), detallando en qué momento el riesgo es más alto.\n7. Resumen de Rotación y Plan de Acción (Síntesis con IA)\nEsta es la culminación del dashboard, convirtiendo todos los datos en una conclusión clara y accionable.\nAnálisis Experto Automatizado: El sistema recopila todos los hallazgos clave del dashboard y se los envía a la IA de Gemini para que actúe como un analista experto de RRHH.\nResultados Concretos: La IA genera automáticamente:\nUn Resumen de Rotación: Un párrafo que sintetiza la situación actual.\nUn Plan de Acción Sugerido: Una lista de acciones específicas y priorizadas para mejorar la rotación, basadas directamente en los problemas detectados en tus datos.\n8. Opciones de Usabilidad y Exportación\nTooltips Educativos: La mayoría de las secciones tienen íconos de información para explicarte qué es cada gráfica y cómo leerla.\nExportación a HTML: Te permite guardar una copia interactiva y ligera del dashboard para compartirla fácilmente, con un diseño limpio y bien ajustado.\nExportación a Excel: Te da la opción de descargar todos los datos procesados en un archivo Excel para análisis más profundos o para tus propios reportes.\n\nAn interactive web application to analyze employee turnover data. Upload your 'Activos', 'Bajas', and 'Matriz de Rotación' Excel files to generate a comprehensive dashboard with KPIs, Pareto analysis, and Kaplan-Meier survival curves.",
  "requestFramePermissions": []
}